app/controllers/bugs_controller.rb

  def new
    @bug = Bug.new()
    @project = Project.find_by(id: params[:project_id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]