app/controllers/projects_controller.rb

INSERT INTO "projects" ("title", "description", "created_at", "updated_at", "creator_id") VALUES (?, ?, ?, ?, ?)  [["title", "The Website"], ["description", "To make the front end of website"], ["created_at", "2023-02-01 07:37:49.432433"], ["updated_at", "2023-02-01 07:37:49.432433"], ["creator_id", 1]]
---
  def create
    #@project =Project.new
    @project = Project.new(project_params)
    #@project = current_user
    #@project = current_user.id
    @project.creator_id = current_user.id
    if @project.save

DELETE FROM "projects" WHERE "projects"."id" = ?  [["id", 3]]
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def destroy
    if can? :destroy, @project
      #@project = Project.find(params[:id])
      @project = Project.find(params[:id]).destroy